# Hectare Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..Hectare Property
SymbolTypeId Class See Also
---
Symbol hectare, indicating unit Hectares.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Hectare { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Hectare As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Hectare {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace